podcast/app/controllers/episodes_controller.rb

	def update
		if @episode.update episode_params
---
UPDATE "episodes" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "episodes"."id" = ?  [["title", "A real episode name"], ["description", "a real episode description not a lorem ipsum :D"], ["updated_at", "2017-07-22 21:44:30.761056"], ["id", 2]]

	def destroy
		@episode.destroy
---
DELETE FROM "episodes" WHERE "episodes"."id" = ?  [["id", 3]]

	def create
		@episode = @user.episodes.new episode_params
		if @episode.save
---
INSERT INTO "episodes" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "number 1"], ["description", "jsut a description for testing purpose "], ["user_id", 1], ["created_at", "2017-07-22 19:09:38.378291"], ["updated_at", "2017-07-22 19:09:38.378291"]]

	def show
		@episodes = Episode.where(user_id: @user).order("created_at DESC").reject { |e|	e.id == @episode.id }
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."user_id" = 1  ORDER BY created_at DESC

	def find_user
		@user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

	def find_episode
		if params[:id].nil?
			@episode = current_episode
		else
			@episode = Episode.find(params[:id])
---
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 4]]