podcast/app/controllers/users_controller.rb

	def index
		@users = User.all.order("created_at DESC")
---
SELECT "users".* FROM "users"  ORDER BY created_at DESC

	def find_user
		if params[:id].nil?
			@user = current_user
		else
			@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

	def find_episode
		@episodes = Episode.where(user_id: @user).order("created_at DESC")
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."user_id" IS NULL  ORDER BY created_at DESC