podcast/app/controllers/users_controller.rb

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@user = User.find(params[:id])
		@episode = Episode.find(params[:id])